Revit 2027 API
EdgeArrayArray.Append Method
Add the edge array to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	EdgeArray item
)
Public Overridable Sub Append (
	item As EdgeArray
)
public:
virtual void Append(
	EdgeArray^ item
)
abstract Append :
        item : EdgeArray -> unit
override Append :
        item : EdgeArray -> unit
Parameters
item EdgeArray
The edge array to be added.
See Also
Reference
EdgeArrayArray Class
Autodesk.Revit.DB Namespace